app/graphql/mutations/create_card.rb

    def resolve(title:)
      Card.create!(title: title)
---
INSERT INTO "cards" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "asdasd"], ["created_at", "2021-06-04 15:04:55.211889"], ["updated_at", "2021-06-04 15:04:55.211889"]]