app/graphql/mutations/destroy_card.rb

    def resolve(id:)
      Card.find(id).destroy!
---
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 4]]
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]