app/mailers/to_do_mailer.rb

  def new_todo
    @user = params[:user]
    @card_user = User.find_by_id(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]