app/views/users/show.html.erb

  <div class="col-md-8">
      <h3>Cards (<%= @user.cards.count %>)</h3>
---
SELECT "cards".* FROM "cards" WHERE "cards"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "cards" WHERE "cards"."user_id" = $1  [["user_id", 1]]