app/views/to_do_mailer/new_todo.html.erb

SELECT COUNT(*) FROM "todos" WHERE "todos"."user_id" = $1  [["user_id", 1]]
---
</p>
<!--<p><%#= @user.todos.find_by(id = @user.todos.count)%></p>-->