app/views/cards/show.html.slim

  ol.todos
    - @card.todos.each do |todo|
---
SELECT "todos".* FROM "todos" WHERE "todos"."card_id" = $1  [["card_id", 3]]

          |  created By
          = User.find_by(id: todo.user_id).name
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]