app/controllers/cards_controller.rb

  def create
=begin
     @card = Card.new(card_params)
=end

    @card = current_user.cards.build(card_params)

    respond_to do |format|
      if @card.save
---
INSERT INTO "cards" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Card by Damir"], ["created_at", "2021-06-09 14:37:34.125978"], ["updated_at", "2021-06-09 14:37:34.125978"], ["user_id", 3]]

  def set_card
    @card = Card.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]