app/controllers/todos_controller.rb

SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "todos" ("title", "description", "created_at", "updated_at", "card_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "qwewqe"], ["description", "124213"], ["created_at", "2021-06-09 13:18:55.943911"], ["updated_at", "2021-06-09 13:18:55.943911"], ["card_id", 2], ["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def create
    @card = Card.find(params[:card_id])
    @todo = @card.todos.build(title: params[:title], description: params[:description], user_id: params[:user_id])
    if @todo.save
      ToDoMailer.with(user: current_user, user_id: @card.user_id).new_todo.deliver_now